// Задача 1: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
/*
int Findnum(int num)
{
    int des = num / 10;
    int ed = des % 10;
    return ed;
}

Console.Write("Input a threedigit number: ");
int num = Convert.ToInt32(Console.ReadLine());
int result = Findnum(num);
Console.WriteLine(result);
*/
