// 1. Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от N до 1.
/*
void ShowNumbers(int n)
{
    Console.Write(n +" ");
    if(n>1) ShowNumbers(n-1);
}

Console.Write("Input a number: ");
int num = Convert.ToInt32(Console.ReadLine());
ShowNumbers(num);
*/